Sani7/STM32HAL-MCP2515/mcp2515.c
#include "mcp2515.h"
#include "mcp2515_consts.h"
#include <stm32f0xx_hal.h>

#define SPI_TIMEOUT 10

void MCP2515_Init(MCP2515_HandleTypeDef* hcan, SPI_HandleTypeDef* hspi, GPIO_TypeDef* cs_port, uint16_t cs_pin) {
    hcan->hspi = hspi;
    hcan->cs_port = cs_port;
    hcan->cs_pin = cs_pin;
}

uint8_t MCP2515_SPI_transfer(MCP2515_HandleTypeDef* hcan, uint8_t txByte) {
    uint8_t rxByte;
    HAL_SPI_TransmitReceive(hcan->hspi, &txByte, &rxByte, 1, SPI_TIMEOUT);
    return rxByte;
}

void MCP2515_Set_Register(MCP2515_HandleTypeDef* hcan, uint8_t reg, uint8_t value) {
    HAL_GPIO_WritePin(hcan->cs_port, hcan->cs_pin, GPIO_PIN_RESET);
    MCP2515_SPI_transfer(hcan, INSTRUCTION_WRITE);
    MCP2515_SPI_transfer(hcan, reg);
    MCP2515_SPI_transfer(hcan, value);
    HAL_GPIO_WritePin(hcan->cs_port, hcan->cs_pin, GPIO_PIN_SET);
}

void MCP2515_Set_Registers(MCP2515_HandleTypeDef* hcan, uint8_t reg, uint8_t values[], uint8_t n) {
    HAL_GPIO_WritePin(hcan->cs_port, hcan->cs_pin, GPIO_PIN_RESET);
    MCP2515_SPI_transfer(hcan, INSTRUCTION_WRITE);
    MCP2515_SPI_transfer(hcan, reg);
    for (uint8_t i = 0; i < n; i++) {
        MCP2515_SPI_transfer(hcan, values[i]);
    }

    //  HAL_SPI_Transmit(SPI_CAN, values, n, SPI_TIMEOUT);
    HAL_GPIO_WritePin(hcan->cs_port, hcan->cs_pin, GPIO_PIN_SET);
}

void MCP2515_Load_Tx(MCP2515_HandleTypeDef* hcan, uint8_t reg, uint8_t values[], uint8_t n) {
    HAL_GPIO_WritePin(hcan->cs_port, hcan->cs_pin, GPIO_PIN_RESET);
    // MCP2515_SPI_transfer(hcan, INSTRUCTION_WRITE);
    MCP2515_SPI_transfer(hcan, reg);
    for (uint8_t i = 0; i < n; i++) {
        MCP2515_SPI_transfer(hcan, values[i]);
    }

    //  HAL_SPI_Transmit(SPI_CAN, values, n, SPI_TIMEOUT);
    HAL_GPIO_WritePin(hcan->cs_port, hcan->cs_pin, GPIO_PIN_SET);
}

void MCP2515_Modify_Register(MCP2515_HandleTypeDef* hcan, uint8_t reg, uint8_t mask, uint8_t data) {
    HAL_GPIO_WritePin(hcan->cs_port, hcan->cs_pin, GPIO_PIN_RESET);
    MCP2515_SPI_transfer(hcan, INSTRUCTION_BITMOD);
    MCP2515_SPI_transfer(hcan, reg);
    MCP2515_SPI_transfer(hcan, mask);
    MCP2515_SPI_transfer(hcan, data);
    HAL_GPIO_WritePin(hcan->cs_port, hcan->cs_pin, GPIO_PIN_SET);
}

uint8_t MCP2515_Read_Register(MCP2515_HandleTypeDef* hcan, REGISTER reg) {
    HAL_GPIO_WritePin(hcan->cs_port, hcan->cs_pin, GPIO_PIN_RESET);
    MCP2515_SPI_transfer(hcan, INSTRUCTION_READ);
    MCP2515_SPI_transfer(hcan, reg);
    uint8_t ret = MCP2515_SPI_transfer(hcan, 0x00);
    HAL_GPIO_WritePin(hcan->cs_port, hcan->cs_pin, GPIO_PIN_SET);

    return ret;
}

void MCP2515_Read_Registers(MCP2515_HandleTypeDef* hcan, REGISTER reg, uint8_t values[], uint8_t n) {
    HAL_GPIO_WritePin(hcan->cs_port, hcan->cs_pin, GPIO_PIN_RESET);
    MCP2515_SPI_transfer(hcan, INSTRUCTION_READ);
    MCP2515_SPI_transfer(hcan, reg);
    // mcp2515 has auto-increment of address-pointer
    for (uint8_t i = 0; i < n; i++) {
        values[i] = MCP2515_SPI_transfer(hcan, 0x00);
        // HAL_SPI_Receive(&hspi4, values, n, SPI_TIMEOUT);  //Todo, check if the 0x00 from above is needed
    }
    HAL_GPIO_WritePin(hcan->cs_port, hcan->cs_pin, GPIO_PIN_SET);
}

void MCP2515_Read_Rx(MCP2515_HandleTypeDef* hcan, REGISTER reg, uint8_t values[], uint8_t n) {
    HAL_GPIO_WritePin(hcan->cs_port, hcan->cs_pin, GPIO_PIN_RESET);
    MCP2515_SPI_transfer(hcan, reg);
    // mcp2515 has auto-increment of address-pointer
    for (uint8_t i = 0; i < n; i++) {
        values[i] = MCP2515_SPI_transfer(hcan, 0x00);
        // HAL_SPI_Receive(&hspi4, values, n, SPI_TIMEOUT);  //Todo, check if the 0x00 from above is needed
    }
    HAL_GPIO_WritePin(hcan->cs_port, hcan->cs_pin, GPIO_PIN_SET);
}

CAN_Error MCP2515_Set_Mode(MCP2515_HandleTypeDef* hcan, CANCTRL_REQOP_MODE mode) {
    unsigned long endTime = HAL_GetTick() + 10;
    uint8_t modeMatch = 0;
    while (HAL_GetTick() < endTime) {
        MCP2515_Modify_Register(hcan, MCP_CANCTRL, CANCTRL_REQOP, mode);
        uint8_t newmode = MCP2515_Read_Register(hcan, MCP_CANSTAT);
        newmode &= CANSTAT_OPMOD;

        modeMatch = newmode == mode;

        if (modeMatch) {
            break;
        }
    }

    return modeMatch ? ERROR_OK : ERROR_FAIL;
}

CAN_Error MCP2515_Set_Config_Mode(MCP2515_HandleTypeDef* hcan) {
    return MCP2515_Set_Mode(hcan, CANCTRL_REQOP_CONFIG);
}

void MCP2515_Prepare_Id(uint8_t* buffer, uint8_t ext, uint32_t id) {
    uint16_t canid = (uint16_t)(id & 0x0FFFF);

    if (ext) {
        buffer[MCP_EID0] = (uint8_t)(canid & 0xFF);
        buffer[MCP_EID8] = (uint8_t)(canid >> 8);
        canid = (uint16_t)(id >> 16);
        buffer[MCP_SIDL] = (uint8_t)(canid & 0x03);
        buffer[MCP_SIDL] += (uint8_t)((canid & 0x1C) << 3);
        buffer[MCP_SIDL] |= TXB_EXIDE_MASK;
        buffer[MCP_SIDH] = (uint8_t)(canid >> 5);
    } else {
        buffer[MCP_SIDH] = (uint8_t)(canid >> 3);
        buffer[MCP_SIDL] = (uint8_t)((canid & 0x07) << 5);
        buffer[MCP_EID0] = 0;
        buffer[MCP_EID8] = 0;
    }
}

uint8_t MCP2515_Get_Status(MCP2515_HandleTypeDef* hcan) {
    HAL_GPIO_WritePin(hcan->cs_port, hcan->cs_pin, GPIO_PIN_RESET);
    MCP2515_SPI_transfer(hcan, INSTRUCTION_READ_STATUS);
    uint8_t i = MCP2515_SPI_transfer(hcan, 0x00);
    HAL_GPIO_WritePin(hcan->cs_port, hcan->cs_pin, GPIO_PIN_SET);
    return i;
}

CAN_Error MCP2515_Set_Filter_Mask(MCP2515_HandleTypeDef* hcan, MASK mask, uint8_t ext, uint32_t ulData) {
    CAN_Error res = MCP2515_Set_Config_Mode(hcan);
    if (res != ERROR_OK) {
        return res;
    }

    uint8_t tbufdata[4];
    MCP2515_Prepare_Id(tbufdata, ext, ulData);

    REGISTER reg;
    switch (mask) {
        case MASK0:
            reg = MCP_RXM0SIDH;
            break;
        case MASK1:
            reg = MCP_RXM1SIDH;
            break;
        default:
            return ERROR_FAIL;
    }

    MCP2515_Set_Registers(hcan, reg, tbufdata, 4);

    return ERROR_OK;
}

CAN_Error MCP2515_Set_Filter(MCP2515_HandleTypeDef* hcan, RXF num, uint8_t ext, uint32_t ulData) {
    CAN_Error res = MCP2515_Set_Config_Mode(hcan);
    if (res != ERROR_OK) {
        return res;
    }

    REGISTER reg;

    switch (num) {
        case RXF0:
            reg = MCP_RXF0SIDH;
            break;
        case RXF1:
            reg = MCP_RXF1SIDH;
            break;
        case RXF2:
            reg = MCP_RXF2SIDH;
            break;
        case RXF3:
            reg = MCP_RXF3SIDH;
            break;
        case RXF4:
            reg = MCP_RXF4SIDH;
            break;
        case RXF5:
            reg = MCP_RXF5SIDH;
            break;
        default:
            return ERROR_FAIL;
    }

    uint8_t tbufdata[4];
    MCP2515_Prepare_Id(tbufdata, ext, ulData);
    MCP2515_Set_Registers(hcan, reg, tbufdata, 4);

    return ERROR_OK;
}

