Sani7/STM32HAL-MCP2515/mcp2515.c
    uint8_t rts_addr = (1 << txbn) | 0x80;

    uint8_t data[13];

    uint8_t ext = !!(frame->can_id & CAN_EFF_FLAG);
    uint8_t rtr = !!(frame->can_id & CAN_RTR_FLAG);
    uint32_t id = (frame->can_id & (ext ? CAN_EFF_MASK : CAN_SFF_MASK));

    MCP2515_Prepare_Id(data, ext, id);

    data[MCP_DLC] = rtr ? (frame->can_dlc | RTR_MASK) : frame->can_dlc;

    for (int i = 0; i < frame->can_dlc; i++) {
        data[MCP_DATA + i] = frame->data[i];
    }

    // memcpy(&data[MCP_DATA], frame->data, frame->can_dlc);

    MCP2515_Load_Tx(hcan, load_addr, data, 5 + frame->can_dlc);
    // MCP2515_Set_Registers(hcan, load_addr, data, 5 + frame->can_dlc);

    // MCP2515_Modify_Register(hcan, txbuf->CTRL, TXB_TXREQ, TXB_TXREQ);
    // MCP2515_Modify_Register(hcan, rts_addr, TXB_TXREQ, TXB_TXREQ);
    MCP2515_Request_To_Send(hcan, rts_addr);
    // MCP2515_Set_Register(hcan, rts_addr, TXB_TXREQ);

    uint8_t ctrl = MCP2515_Read_Register(hcan, rts_addr);
    if ((ctrl & (TXB_ABTF | TXB_MLOA | TXB_TXERR)) != 0) {
        return ERROR_FAILTX;
    }
    return ERROR_OK;
}

CAN_Error MCP2515_Send_Message(MCP2515_HandleTypeDef* hcan, can_frame_t* frame) {
    if (frame->can_dlc > CAN_MAX_DLEN) {
        return ERROR_FAILTX;
    }

    for (uint8_t i = 0; i < N_TXBUFFERS; i++) {
        uint8_t ctrlval = MCP2515_Read_Register(hcan, (i + 3) << 4);
        if ((ctrlval & TXB_TXREQ) == 0) {
            return MCP2515_Send_Message_To(hcan, i, frame);
        }
    }

    return ERROR_ALLTXBUSY;
}

CAN_Error MCP2515_Read_Message_From(MCP2515_HandleTypeDef* hcan, RXBn rxbn, can_frame_t* frame) {
    uint8_t readCommand = (rxbn << 2) | 0x90;
    rx_reg_t rxReg;

    MCP2515_Read_Rx(hcan, readCommand, rxReg.rx_reg_array, sizeof(rxReg.rx_reg_array));

    uint32_t id = (rxReg.rx_reg_array[MCP_SIDH] << 3) + (rxReg.rx_reg_array[MCP_SIDL] >> 5);

    if ((rxReg.rx_reg_array[MCP_SIDL] & TXB_EXIDE_MASK) == TXB_EXIDE_MASK) {
        id = (id << 2) + (rxReg.rx_reg_array[MCP_SIDL] & 0x03);
        id = (id << 8) + rxReg.rx_reg_array[MCP_EID8];
        id = (id << 8) + rxReg.rx_reg_array[MCP_EID0];
        id |= CAN_EFF_FLAG;
    }

    uint8_t dlc = (rxReg.rx_reg_array[MCP_DLC] & DLC_MASK);
    if (dlc > CAN_MAX_DLEN) {
        return ERROR_FAIL;
    }

    // 0x60 or 0x70
    uint8_t ctrl = MCP2515_Read_Register(hcan, (rxbn + 6) << 4);
    if (ctrl & RXBnCTRL_RTR) {
        id |= CAN_RTR_FLAG;
    }

    frame->can_id = id;
    frame->can_dlc = dlc;

    frame->data[0] = rxReg.RXBnD0;
    frame->data[1] = rxReg.RXBnD1;
    frame->data[2] = rxReg.RXBnD2;
    frame->data[3] = rxReg.RXBnD3;
    frame->data[4] = rxReg.RXBnD4;
    frame->data[5] = rxReg.RXBnD5;
    frame->data[6] = rxReg.RXBnD6;
    frame->data[7] = rxReg.RXBnD7;

    // Clear the inbox interrupt, 0x1 or 0x2
    MCP2515_Modify_Register(hcan, MCP_CANINTF, rxbn + 1, 0);

    return ERROR_OK;
}

CAN_Error MCP2515_Read_Message(MCP2515_HandleTypeDef* hcan, can_frame_t* frame) {
    CAN_Error rc;
    uint8_t stat = MCP2515_Get_Status(hcan);

    if (stat & STAT_RX0IF) {
        rc = MCP2515_Read_Message_From(hcan, RXB0, frame);
    } else if (stat & STAT_RX1IF) {
        rc = MCP2515_Read_Message_From(hcan, RXB1, frame);
    } else {
        rc = ERROR_NOMSG;
    }

    return rc;
}

uint8_t MCP2515_Check_Receive(MCP2515_HandleTypeDef* hcan) {
    uint8_t res = MCP2515_Get_Status(hcan);
    if (res & STAT_RXIF_MASK) {
        return 1;
    }

    return 0;
}

uint8_t MCP2515_Get_Error_Flags(MCP2515_HandleTypeDef* hcan) {
    return MCP2515_Read_Register(hcan, MCP_EFLG);
}

uint8_t MCP2515_Check_Error(MCP2515_HandleTypeDef* hcan) {
    uint8_t eflg = MCP2515_Get_Error_Flags(hcan);

    if (eflg & EFLG_ERRORMASK) {
        return 1;
    } else {
        return 0;
    }
}

void MCP2515_Clear_RXn_OVR_Flags(MCP2515_HandleTypeDef* hcan) {
    MCP2515_Modify_Register(hcan, MCP_EFLG, EFLG_RX0OVR | EFLG_RX1OVR, 0);
}

uint8_t MCP2515_Get_Interrupts(MCP2515_HandleTypeDef* hcan) {
    return MCP2515_Read_Register(hcan, MCP_CANINTF);
}

void MCP2515_Clear_Interrupts(MCP2515_HandleTypeDef* hcan) {
    MCP2515_Set_Register(hcan, MCP_CANINTF, 0);
}

uint8_t MCP2515_Get_Interrupt_Mask(MCP2515_HandleTypeDef* hcan) {
    return MCP2515_Read_Register(hcan, MCP_CANINTE);
}

void MCP2515_Clear_TX_Interrupts(MCP2515_HandleTypeDef* hcan) {
    MCP2515_Modify_Register(hcan, MCP_CANINTF, (CANINTF_TX0IF | CANINTF_TX1IF | CANINTF_TX2IF), 0);
}

void MCP2515_Clear_RXn_OVR(MCP2515_HandleTypeDef* hcan) {
    uint8_t eflg = MCP2515_Get_Error_Flags(hcan);
    if (eflg != 0) {
        MCP2515_Clear_RXn_OVR_Flags(hcan);
        MCP2515_Clear_Interrupts(hcan);
        // MCP2515_Modify_Register(hcan, MCP_CANINTF, CANINTF_ERRIF, 0);
    }
}

void MCP2515_Clear_MERR(MCP2515_HandleTypeDef* hcan) {
    // MCP2515_Modify_Register(hcan, MCP_EFLG, EFLG_RX0OVR | EFLG_RX1OVR, 0);
    // clearInterrupts();
    MCP2515_Modify_Register(hcan, MCP_CANINTF, CANINTF_MERRF, 0);
}

void MCP2515_Clear_ERRIF(MCP2515_HandleTypeDef* hcan) {
    // MCP2515_Modify_Register(hcan, MCP_EFLG, EFLG_RX0OVR | EFLG_RX1OVR, 0);
    // clearInterrupts();
    MCP2515_Modify_Register(hcan, MCP_CANINTF, CANINTF_ERRIF, 0);
}
